import { BaseDict } from "@solid-primitives/i18n";

export const dict = {
	home: {
		meta: {
			title: "ФПМ",
			description: "Головна сторінка сайту факультету прикладної математики",
		},
		main: {
			h1: "Факультет Прикладної Математики",
			p: "Хочеш знати чому саме наш факультет — це те, що тобі потрібно?",
			more: "Читати",
		},
		specialities: {
			h2: "Спеціальності",
			113: {
				title: "113 — Прикладна математика",
				description:
					"Освітня програма: “Наука про дані (Data Science) та математичне моделювання”",
			},
			121: {
				title: "121 — Інженерія програмного забезпечення",
				description:
					"Освітна програма: “Інженерія програмного забезпечення мультимедійних та інформаційно-пошукових систем”",
			},
			123: {
				title: "123 — Компʼютерна інженерія",
				description:
					"Освітна програма: “Системне програмування та спеціалізовані комп’ютерні системи”",
			},
			more: "Детальніше",
		},
		news: {
			h2: "Новини",
			more: "Більше новин",
		},
	},
} satisfies BaseDict;
